#include "soft_iic_gpio.h"
#include "delay.h"


/*
	应用说明：
	在访问IIC设备前，请先调用 IIC_CheckDevice() 检测IIC设备是否正常，该函数会配置GPIO

*/

static void IIC_CfgGpio(void);


/*
*********************************************************************************************************
*	函 数 名: IIC_Delay
*	功能说明: IIC总线位延迟，最快1KHz
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
static void IIC_Delay(uint32_t t)
{
	delay_us(t);
}

/*
*********************************************************************************************************
*	函 数 名: IIC_Start
*	功能说明: CPU发起IIC总线启动信号
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void IIC_Start(void)
{
	/* 当SCL高电平时，SDA出现一个下跳沿表示IIC总线启动信号 */
	IIC_SDA_1();
	IIC_SCL_1();
	IIC_Delay(4);
	IIC_SDA_0();
	IIC_Delay(4);
	IIC_SCL_0();		//钳住I2C总线，准备发送或接收数据
}

/*
*********************************************************************************************************
*	函 数 名: IIC_Start
*	功能说明: CPU发起IIC总线停止信号
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void IIC_Stop(void)
{
	/* 当SCL高电平时，SDA出现一个上跳沿表示IIC总线停止信号 */
	IIC_SCL_0();
	IIC_SDA_0();
	IIC_Delay(4);
	IIC_SCL_1();
	IIC_SDA_1();
	IIC_Delay(4);
}

/*
*********************************************************************************************************
*	函 数 名: void IIC_SendByte(uint8_t _ucByte)
*	功能说明: CPU向IIC总线设备发送8bit数据
*	形    参：_ucByte ： 等待发送的字节
*	返 回 值: 无
*********************************************************************************************************
*/
void IIC_SendByte(uint8_t _ucByte)
{
	uint8_t i;
    IIC_SCL_0();//拉低时钟开始数据传输

	/* 先发送字节的高位bit7 */
	for (i = 0; i < 8; i++)
	{		
		if (_ucByte & 0x80 )
		{
			IIC_SDA_1();
		}
		else
		{
			IIC_SDA_0();
		}
		IIC_Delay(2);
		IIC_SCL_1();
		IIC_Delay(2);	
		IIC_SCL_0();
		 if (i == 7)
		 {
		 	 IIC_SDA_1(); // 释放总线
		 }
		  _ucByte <<= 1;	/* 左移一个bit */
		IIC_Delay(2);
	}
}

/*
*********************************************************************************************************
*	函 数 名: uint8_t IIC_ReadByte(uint8_t ack)
*	功能说明: CPU从IIC总线设备读取8bit数据
*	形    参：无
*	返 回 值: 读到的数据
*********************************************************************************************************
*/
uint8_t IIC_ReadByte(uint8_t ack)
{
	uint8_t i, value=0;
	/* 读到第1个bit为数据的bit7 */
	for (i = 0; i < 8; i++)
	{
		IIC_SCL_0();
		IIC_Delay(2);
		IIC_SCL_1();
		value<<=1;
		if (IIC_SDA_READ())
		{
			value++;
		}
		IIC_Delay(1);
	}
	if(!ack)
		IIC_NAck();
	else
		IIC_Ack();
	return value;
}

/*
*********************************************************************************************************
*	函 数 名: uint8_t IIC_WaitAck(void)
*	功能说明: CPU产生一个时钟，并读取器件的ACK应答信号
*	形    参：无
*	返 回 值: 返回0表示正确应答，1表示无器件响应
*********************************************************************************************************
*/
uint8_t IIC_WaitAck(void)
{
	uint8_t temp=0;
	IIC_SDA_1();	/* CPU释放SDA总线 */
	IIC_Delay(1);
	IIC_SCL_1();	/* CPU驱动SCL = 1, 此时器件会返回ACK应答 */
	IIC_Delay(1);
	while(IIC_SDA_READ())
	{
		temp++;
		if(temp>250)
		{
			IIC_Stop();
			return 1;
		}
	}
	IIC_SCL_0();
	return 0;
}

/*
*********************************************************************************************************
*	函 数 名: IIC_Ack
*	功能说明: CPU产生一个ACK信号
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void IIC_Ack(void)
{
	IIC_SCL_0();
	IIC_SDA_0();	/* CPU驱动SDA = 0 */
	IIC_Delay(2);
	IIC_SCL_1();	/* CPU产生1个时钟 */
	IIC_Delay(2);
	IIC_SCL_0();
}

/*
*********************************************************************************************************
*	函 数 名: IIC_NAck
*	功能说明: CPU产生1个NACK信号
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void IIC_NAck(void)
{
	IIC_SCL_0();
	IIC_SDA_1();	/* CPU驱动SDA = 1 */
	IIC_Delay(2);
	IIC_SCL_1();	/* CPU产生1个时钟 */
	IIC_Delay(2);
	IIC_SCL_0();
}

/*
*********************************************************************************************************
*	函 数 名: IIC_CfgGpio
*	功能说明: 配置IIC总线的GPIO，采用模拟IO的方式实现
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
static void IIC_CfgGpio(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;

	RCC_AHB1PeriphClockCmd(IIC_GPIO_CLK, ENABLE);	/* 打开GPIO时钟 */

	GPIO_InitStructure.GPIO_Pin = IIC_SCL_PIN | IIC_SDA_PIN;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;  	
	GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;  	/* 开漏输出 */
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
	GPIO_Init(IIC_GPIO_PORT, &GPIO_InitStructure);

	/* 给一个停止信号, 复位IIC总线上的所有设备到待机模式 */
	IIC_SCL_1();
	IIC_SDA_1();
}

/*
*********************************************************************************************************
*	函 数 名: uint8_t IIC_CheckDevice(uint8_t _Address)
*	功能说明: 检测IIC总线设备，CPU向发送设备地址，然后读取设备应答来判断该设备是否存在
*	形    参：_Address：设备的IIC总线地址
*	返 回 值: 返回值 0 表示正确， 返回1表示未探测到
*********************************************************************************************************
*/
uint8_t IIC_Init(uint8_t _Address)
{
	uint8_t ucAck;

	IIC_CfgGpio();		/* 配置GPIO */

	IIC_Start();		/* 发送启动信号 */

	return ucAck;
}
