#include "system.h"

/**********************************************************************************************************
*函 数 名: static uint8_t GY_91_Init(void)
*功能说明: GY-91模块初始化
*形    参: 无
*返 回 值: 1 成功  0 失败
**********************************************************************************************************/
static uint8_t GY_91_Init(void)
{
	IIC_Init(MPU9250_ADDR);
	MPU9250_Init();
	BMP280_Init();
	return 1;
}

/**********************************************************************************************************
*函 数 名: void systemInit(void)
*功能说明: 底层硬件初始化
*形    参: 无
*返 回 值: 无
**********************************************************************************************************/
void systemInit(void)
{
	nvicInit();			
	uart_init(115200);
	delay_init(168);	
	ledInit();			
	//ledStripInit();
	GY_91_Init();
	CPPM_Init();
	MOTOR_Init();
	beeperInit();
}
